candy_store/app/controllers/candies_controller.rb

    def index
        # if params[:sort_by] == "name"
        #     @candies = Candy.order("name")
        # elsif params[:sort_by] == "calories"
        #     @candies = Candy.order("calories")
        # else
        #     @candies = Candy.all
        # end
    # column = params[:sort_by] # => name/calories/nil
    @candies = Candy.order(params[:sort_by])
---
SELECT "candies".* FROM "candies" ORDER BY calorie_count

    def show
        @candy = Candy.find(params[:id])
---
SELECT "candies".* FROM "candies" WHERE "candies"."id" = ? LIMIT ?  [["id", 46], ["LIMIT", 1]]

    def create
        candy = Candy.create(name: params[:candy][:name],
                     wrapper_color: params[:candy][:wrapper_color],
                     calories: params[:candy][:calories],
                     has_nuts: params[:candy][:has_nuts])
---
INSERT INTO "candies" ("name", "calories", "wrapper_color", "has_nuts", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Scooby Snack"], ["calories", 4], ["wrapper_color", "psychadelic"], ["has_nuts", 0], ["created_at", "2020-10-29 19:48:05.941622"], ["updated_at", "2020-10-29 19:48:05.941622"]]

    def edit
        @candy = Candy.find(params[:id])
---
SELECT "candies".* FROM "candies" WHERE "candies"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]

    def update
        candy = Candy.find(params[:id])
        candy.update(name: params[:candy][:name],
                     wrapper_color: params[:candy][:wrapper_color],
                     calories: params[:candy][:calories],
                     has_nuts: params[:candy][:has_nuts])
---
SELECT "candies".* FROM "candies" WHERE "candies"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]
UPDATE "candies" SET "wrapper_color" = ?, "updated_at" = ? WHERE "candies"."id" = ?  [["wrapper_color", ""], ["updated_at", "2020-10-29 20:49:02.585370"], ["id", 44]]